/*************************************************************************
	> File Name: 1.c
	> Author: 刘怪怪
	> Mail: 
	> Created Time: 2018年04月23日 星期一 16时51分46秒
 ************************************************************************/

#include<stdio.h>
int main()
{
    int nums[3][3] = {1,2,3,4,5,6,7,8,9};
    printf("%d\n",nums[1][-2]);  
    /*
     * nums[1][1] 
     * nums + 1  以每行为单位移动 
     * nums[1] 以每个移动 
     *
     */
      // printf("地址%p %p,  %p %p\n" ,nums[0] + 1,nums[1], nums, nums+1);
    /*
     * () []  优先级相同 从左到右依次进行运算即可 
     * - 比 [] 低 , 1优先与[]结合 
     */
    printf("%d\n",(-1)[nums][5] );
    printf("%d\n",-1[nums][5]);  
    return 0;


}
